{"wIdent": ["An unsigned integer that specifies that this is a Word Binary File. This value MUST be 0xA5EC", 2], "nFib": ["An unsigned integer that specifies the version number of the file format used. Superseded by FibRgCswNew.nFibNewif it is present. This value SHOULD<12>be 0x00C1.", 2], "ununsed": ["This value is undefined and MUST be ignore", 2], "lid": ["A LIDthat specifies the install language of the application that is producing the document. If nFibis 0x00D9 or greater, then any East Asian install lid or any install lid with a base language of Spanish, German or French MUST be recorded as lidAmerican. If the nFibis 0x0101 or greater, then any install lid with a base language of Vietnamese, Thai, or Hindi MUST be recorded as lidAmerican.", 2], "pnNext": ["An unsigned integer that specifies the offset in the WordDocument streamof the FIBfor the document which contains all the AutoTextitems. If this value is 0, there are no AutoText items attached. Otherwise the FIBis found at file location pnNext×512. If fGlsyis 1 or fDotis 0, this value MUST be 0. If pnNextis not 0, each FIBMUST share the same values for FibRgFcLcb97.fcPlcBteChpx, FibRgFcLcb97.lcbPlcBteChpx, FibRgFcLcb97.fcPlcBtePapx, FibRgFcLcb97.lcbPlcBtePapx, andFibRgLw97.cbMac.", 2], "flag1": ["Flag", 2, "bits", ["fDot", "fGlsy", "fComplex", "fHasPic", "cQuickSaves", "fEncrypted", "fWhichTblStm", "fReadOnlyRecommended", "fWriteReservation", "fExtChar", "fLoadOverride", "fFarEast", "fObfuscated"], [1, 1, 1, 1, 4, 1, 1, 1, 1, 1, 1, 1, 1]], "nFibBack": ["This value SHOULD<14>be 0x00BF. This value MUST be 0x00BF or 0x00C", 2], "lKey": [" If fEncryptedis 1 and fObfuscationis 1, this value specifies the XOR obfuscation (section 2.2.6.1) password verifier. If fEncryptedis 1 and fObfuscationis 0, this value specifies the size of the EncryptionHeaderthat is stored at the beginning of the Table stream as described in Encryption and Obfuscation. Otherwise, this value MUST be 0", 4], "envr": ["This value MUST be 0, and MUST be ignored", 1], "flag2": ["Flag", 1, "bits", ["fMac", "fEmptySpecial", "fLoadOverridePage", "reserved1", "reserved2", "fSpare0"], [1, 1, 1, 1, 1, 3]], "reserved3": ["This value MUST be 0 and MUST be ignore", 2], "reserved4": ["This value MUST be 0 and MUST be ignore", 2], "reserved5": ["This value is undefined and MUST be ignore", 4], "reserved6": ["This value is undefined and MUST be ignore", 4]}